export default {
    meta: {
        appName: 'Дестинация: България'
    },
    general: {
        environment: {
            local: 'Среда за разработка',
            dev: 'Тестова среда'
        },
        error: {
            title: 'Грешка {code}',
            '401': 'За да достъпите тази страница, трябва да се удостоверите!',
            '403': 'Достъпът Ви до тази страница е забранен!',
            '404': 'Страницата, която се опитвате да достъпите, не може да бъде намерена!',
            '419': 'Страницата, която се опитвате да достъпите, е изтекла!',
            '422': 'Вашата заявка не може да бъде обработена в момента!',
            '429': 'Направили сте твърде много заявки!',
            '500': 'Сървърна грешка!',
            '503': 'Услугата е недостъпна!'
        },
        rating: {
            title: 'Рейтинг {rating} от {max_rating}',
            reviews: '{rating} от {reviews} отзива'
        },
        buttons: {
            back: 'Назад',
            backLabel: 'Предходна страница',
            bookmarkAdd: 'Запазване като отметка',
            bookmarkRemove: 'Премахване на отметката',
            bookmarks: 'Отметки',
            change: 'Промяна',
            copy: 'Копиране',
            favoriteAdd: 'Добавяне в любими',
            favoriteRemove: 'Премахване от любими',
            location: 'Споделяне на локация',
            menu: 'Навигация',
            next: 'Напред',
            nextLabel: 'Следваща страница',
            photoPurchase: 'Закупуване на снимката',
            photosAll: 'Всички снимки',
            search: 'Търсене',
            share: 'Споделяне',
            viewAsGrid: 'Преглед като решетка',
            viewAsList: 'Преглед като списък',
            viewAsMap: 'Преглед като карта'
        },
        footer: {
            copyright: '&copy; {year} {name} - всички права запазени.',
            mission:
                'Този уебсайт е създаден с нестопанска цел от доброволци. Чрез него искаме да покажем богатото културно наследство и уникалните природни забележителности на България, за да ви вдъхновим да се отправите на пътешествие и да изследвате.',
            socials: 'Ако харесвате това, което правим, може да ни последвате в следните социални мрежи:',
            donate: 'Също, може да ни подкрепите финансово от тук.'
        }
    },
    page: {
        home: {
            title: 'Начало',
            description: '...'
        },
        about: {
            title: 'За нас',
            description: '...'
        },
        contacts: {
            title: 'Контакти',
            description: '...'
        },
        donate: {
            title: 'Дарения',
            description:
                'Ние изграждаме този уебсайт заедно с помощта на хора като теб. Ако си запален по историята и културата на България, ще се радваме да допринесеш за нашия проект. Твоят принос ще помогне да го направим още по-вълнуващ и ангажиращ за обществеността.'
        },
        explore: {
            title: 'Изследвайте',
            description:
                'Открийте красотата и наследството на България. Разгледайте нейните най-емблематични забележителности, всяка от които показва богатото културно наследство на страната, архитектурната красота и природните чудеса.',
            subtitle: 'Потопете се в наследството'
        },
        trails: {
            title: 'Пътеки',
            description:
                'Впуснете се в живописно пътешествие през спиращите дъха пътеки на България и се потопете в богатата история на страната, разнообразната култура и зашеметяващата природна красота, докато изследвате различните региони по пътя си.',
            subtitle: 'Изследвай неизследваното'
        },
        map: {
            title: 'Карта',
            description:
                'Влезте в очарователния свят на България с история и природна красота. Каним Ви да изследвате многото съкровища на страната, от древни руини до зашеметяващи природни пейзажи.',
            subtitle: 'България - изпълнена с красоти'
        },
        legal: {
            termsAndConditions: {
                title: 'Общи условия'
            },
            privacyPolicy: {
                title: 'Лични данни'
            },
            cookiePolicy: {
                title: 'Бисквитки'
            }
        }
    }
}
